app/Models/Ingreso_Model.php

SELECT *
FROM `legajos`
WHERE `nro_tarjeta` = '31030'
---
    public function get_legajo($nroTarjeta)
    {
        return $this->db->table('legajos')->where('nro_tarjeta', $nroTarjeta)->get()->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `legajos`
WHERE `nro_tarjeta` = '31030'
---
    public function check_tarjeta($nroTarjeta): bool
    {
        return $this->db->table('legajos')->where('nro_tarjeta', $nroTarjeta)->countAllResults() > 0;